Процедура УдалитьЭлементОтбораВСписке(Список,ИмяПоляОтбора) Экспорт
	
	ПользовательскиеНастройки = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	
	Для Каждого ЭлементОтбора Из ПользовательскиеНастройки.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляОтбора) Тогда
			
			ПользовательскиеНастройки.Элементы.Удалить(ЭлементОтбора);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляОтбора) Тогда
			
			Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбора);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляОтбора) Тогда
			
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Удалить(ЭлементОтбора);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляОтбора) Тогда
			
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УстановитьОтборВСписке(Список,ИмяПоля,ЗначениеПоля,ВидСравнения=Неопределено)Экспорт
	
	Если ВидСравнения = Неопределено Тогда
		
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;  
	
	УдалитьЭлементОтбораВСписке(Список,ИмяПоля);
	ЭлементОтбора					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения		= ВидСравнения;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= ЗначениеПоля;
	ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецФункции
