
&НаСервере
Функция ОКНаСервере()
	
	ТекстОшибки = "";
	РаботаСПользователямиИБ.СменитьПарольТекущегоПользователя(Пароль,ТекстОшибки);
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	ПоказатьОповещениеПользователя("Изменение пароля", , "Выполнение операции...", БиблиотекаКартинок.Информация32);
	
	Если Пароль = Подтверждение и не ПустаяСтрока(Пароль) Тогда
		
		ТекстОшибки = ОКНаСервере();
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			
			ПоказатьОповещениеПользователя("Изменение пароля", , "Пароль изменен!", БиблиотекаКартинок.Успешно32);
			Параметры.ПарольИзменен = Истина;
			Закрыть();
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли Пароль <> Подтверждение Тогда 	
		
		ТекстОшибки = "Пароли не совпадают!";
		
	ИначеЕсли ПустаяСтрока(Пароль) Тогда 	
		
		ТекстОшибки = "Нельзя устанавливать пустой пароль!";
		
	КонецЕсли; 
	
	ПоказатьОповещениеПользователя("Изменение пароля", , ТекстОшибки, БиблиотекаКартинок.Ошибка32);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если не ЗавершениеРаботы Тогда
		
		Если Параметры.Требование и Не Параметры.ПарольИзменен Тогда
			
			ЗавершитьРаботуСистемы(Ложь);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
