&НаСервере
Функция ПолучитьСписокЧасовыхПоясовНаСервере()
	
	СписокВыбора = Новый СписокЗначений;
	
	для Каждого чп из ПолучитьДопустимыеЧасовыеПояса()цикл
		
		СписокВыбора.Добавить(чп,чп+" ("+ПредставлениеЧасовогоПояса(чп)+")");
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧасовойПоясИБ = Константы.ЧасовойПоясИБ.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокВыбора = ПолучитьСписокЧасовыхПоясовНаСервере();
	
	Для Каждого элСписка из СписокВыбора Цикл 
		
		Элементы.ЧасовойПоясИБ.СписокВыбора.Добавить(элСписка.Значение,элСписка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЧасовойПоясИБ = Константы.ЧасовойПоясИБ.Получить() Тогда 
		
		Попытка
			
			УстановитьМонопольныйРежим(Истина);
			
			Если ТекущийОбъект.ЧасовойПоясИБ = "" Тогда 
				
				УстановитьЧасовойПоясИнформационнойБазы(ЧасовойПояс());
				
			Иначе 
				
				УстановитьЧасовойПоясИнформационнойБазы(ТекущийОбъект.ЧасовойПоясИБ);
				УстановитьЧасовойПоясСеанса(ТекущийОбъект.ЧасовойПоясИБ);
				
			КонецЕсли;
			
			Константы.ЧасовойПоясИБ.Установить(ЧасовойПоясИБ);
			УстановитьМонопольныйРежим(Ложь);
			
		Исключение
			
			Сообщить("С информационной базой работают другие пользователи. В данный момент невозможно установить монопольный режим!",СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

